---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OriginatingElementId
source: html/c8b95a80-0f70-4ad1-08f5-b3eb59f6bf95.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OriginatingElementId Property

The element id for the originating Revit element.

## Syntax (C#)
```csharp
public LinkElementId OriginatingElementId { get; }
```